MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX154F128B.atdf
      <value-group caption="Deep Sleep Fault Detected bit" name="DSWAKE__DSFLT">
         <value caption="A Fault occurred during Deep Sleep and some Deep Sleep configuration settings may have been corrupted" name="" value="0x1" />
         <value caption="No Fault was detected during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt-on-Change bit" name="DSWAKE__DSINT0">
         <value caption="Interrupt-on-change was asserted during Deep Sleep" name="" value="0x1" />
         <value caption="Interrupt-on-change was not asserted during Deep Sleep" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLVDET" values="HLVDCON__HLVDET" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="External LVDIN pin" name="" value="0xf" />
         <value caption="Reserved; do not use" name="" value="0xe" />
         <value caption="Reserved; do not use" name="" value="0xd" />
         <value caption="Reserved; do not use" name="" value="0xc" />
         <value caption="Reserved; do not use" name="" value="0xb" />
         <value caption="Selects Trip Point 2.50V (Typ.)" name="" value="0xa" />
         <value caption="Selects Trip Point 2.60V (Typ.)" name="" value="0x9" />
         <value caption="Selects Trip Point 2.81V (Typ.)" name="" value="0x8" />
         <value caption="Selects Trip Point 2.92V (Typ.)" name="" value="0x7" />
         <value caption="Selects Trip Point 3.13V (Typ.)" name="" value="0x6" />
         <value caption="Selects Trip Point 3.44V (Typ.)" name="" value="0x5" />
         <value caption="Selects Trip Point 3.59V (Typ.)" name="" value="0x4" />
         <value caption="Reserved; do not use" name="" value="0x3" />
         <value caption="Reserved; do not use" name="" value="0x2" />
         <value caption="Reserved; do not use" name="" value="0x1" />
         <value caption="Reserved; do not use" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detection Event Status bit" name="HLVDCON__HLVDET">
         <value caption="Indicates HLVD Event interrupt is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event interrupt is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap Reference Voltages Stable Status bit" name="HLVDCON__BGVST">
         <value caption="Indicates internal band gap voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal band gap voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Change Direction Select bit" name="HLVDCON__VDIR">
         <value caption="Event occurs when voltage equals or exceeds the trip point (HLVDL)" name="" value="0x1" />
         <value caption="Event occurs when voltage equals or falls below the trip point (HLVDL)" name="" value="0x0" />
      </value-group>
      <value-group caption="HLVD Module Enable bit" name="HLVDCON__ON">
         <value caption="HLVD module is enabled" name="" value="0x0" />
         <value caption="HLVD module is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00774" name="I2C" version="1">
      <register-group name="I2C">
         <register caption="I2C Control Register" name="I2C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C1CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C1CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C1CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C1CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C1CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C1CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C1CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C1CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C1CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C1CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C1CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C1CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C1CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C1CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C1CON__ON" />
         </register>
         <register caption="I2C Control Register" name="I2C2CON" offset="0x100" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C2CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C2CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C2CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C2CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C2CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C2CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C2CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C2CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C2CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C2CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C2CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C2CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C2CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C2CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C2CON__ON" />
         </register>
