MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX154F128B.atdf
         <register caption="Interrupt Priority Control Register" name="IPC6" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="FSCMIS" />
            <bitfield mask="0x0000001C" name="FSCMIP" />
            <bitfield mask="0x00000300" name="RTCCIS" />
            <bitfield mask="0x00001C00" name="RTCCIP" />
            <bitfield mask="0x00030000" name="FCEIS" />
            <bitfield mask="0x001C0000" name="FCEIP" />
            <bitfield mask="0x03000000" name="CMP1IS" />
            <bitfield mask="0x1C000000" name="CMP1IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC7" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CMP2IS" />
            <bitfield mask="0x0000001C" name="CMP2IP" />
            <bitfield mask="0x00000300" name="CMP3IS" />
            <bitfield mask="0x00001C00" name="CMP3IP" />
            <bitfield mask="0x00030000" name="USBIS" />
            <bitfield mask="0x001C0000" name="USBIP" />
            <bitfield mask="0x03000000" name="SPI1IS" />
            <bitfield mask="0x1C000000" name="SPI1IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC8" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U1IS" />
            <bitfield mask="0x0000001C" name="U1IP" />
            <bitfield mask="0x00000300" name="I2C1IS" />
            <bitfield mask="0x00001C00" name="I2C1IP" />
            <bitfield mask="0x00030000" name="CNIS" />
            <bitfield mask="0x001C0000" name="CNIP" />
            <bitfield mask="0x03000000" name="PMPIS" />
            <bitfield mask="0x1C000000" name="PMPIP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC9" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI2IS" />
            <bitfield mask="0x0000001C" name="SPI2IP" />
            <bitfield mask="0x00000300" name="U2IS" />
            <bitfield mask="0x00001C00" name="U2IP" />
            <bitfield mask="0x00030000" name="I2C2IS" />
            <bitfield mask="0x001C0000" name="I2C2IP" />
            <bitfield mask="0x03000000" name="CTMUIS" />
            <bitfield mask="0x1C000000" name="CTMUIP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC10" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA0IS" />
            <bitfield mask="0x0000001C" name="DMA0IP" />
            <bitfield mask="0x00000300" name="DMA1IS" />
            <bitfield mask="0x00001C00" name="DMA1IP" />
            <bitfield mask="0x00030000" name="DMA2IS" />
            <bitfield mask="0x001C0000" name="DMA2IP" />
            <bitfield mask="0x03000000" name="DMA3IS" />
            <bitfield mask="0x1C000000" name="DMA3IP" />
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7" />
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6" />
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5" />
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4" />
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3" />
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2" />
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1" />
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for Multi-vectored mode" name="" value="0x1" />
         <value caption="Interrupt controller configured for Single-vectored mode" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02629" name="NVM" version="4">
      <register-group name="NVM">
         <register caption="Programming Control Register" name="NVMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="NVM Operation bits" mask="0x0000000F" name="NVMOP" values="NVMCON__NVMOP" />
            <bitfield caption="Low-Voltage Detect Status bit (LVD circuit must be enabled)" mask="0x00000800" name="LVDSTAT" values="NVMCON__LVDSTAT" />
            <bitfield caption="Low-Voltage Detect Error bit (LVD circuit must be enabled)" mask="0x00001000" name="LVDERR" values="NVMCON__LVDERR" />
            <bitfield caption="Write Error bit (LVD circuit must be enabled)" mask="0x00002000" name="WRERR" values="NVMCON__WRERR" />
            <bitfield caption="Write Enable bit" mask="0x00004000" name="WREN" values="NVMCON__WREN" />
            <bitfield caption="Write Control bit" mask="0x00008000" name="WR" values="NVMCON__WR" />
         </register>
         <register caption="Programming Unlock Register" name="NVMKEY" offset="0x10" rw="W" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMKEY" />
         </register>
         <register caption="Flash Address Register" name="NVMADDR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMADDR" />
         </register>
