MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX154F128B.atdf
      <value-group caption="Transmit Enable bit" name="U2STA__UTXEN">
         <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Break bit" name="U2STA__UTXBRK">
         <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits" name="" value="0x1" />
         <value caption="Break transmission is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Enable bit" name="U2STA__URXEN">
         <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Polarity Inversion bit" name="U2STA__UTXINV">
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 0 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 1" name="" value="0x1" />
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 1 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Interrupt Mode Selection bits" name="U2STA__UTXISEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt is generated and asserted while the transmit buffer is empty" name="" value="0x2" />
         <value caption="Interrupt is generated and asserted when all characters have been transmitted" name="" value="0x1" />
         <value caption="Interrupt is generated and asserted while the transmit buffer contains at least one empty space" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Address Match Mask bits" name="U2STA__MASK">
         <value caption="Corresponding ADDRx bits are used to detect the address match" name="" value="0x1fe" />
         <value caption="Corresponding ADDRx bits are not used to detect the address match." name="" value="0x0" />
      </value-group>
      <value-group caption="Baud Rate Generator" name="U1BRG__BRG">
         <value caption="Divisor value is 1" name="" value="0x1" />
      </value-group>
      <value-group caption="Baud Rate Generator" name="U2BRG__BRG">
         <value caption="Divisor value is 1" name="" value="0x1" />
      </value-group>
   </module>
   <module caption="" id="02674" name="WDT" version="">
      <register-group name="WDT">
         <register caption="Watchdog Timer Control Register" name="WDTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x00000001" name="WDTWINEN" values="WDTCON__WDTWINEN" />
            <bitfield mask="0x00001F00" name="RUNDIV" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x00008000" name="ON" values="WDTCON__ON" />
            <bitfield mask="0xFFFF0000" name="WDTCLRKEY" />
         </register>
      </register-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="WDTCON__WDTWINEN">
         <value caption="Enable windowed Watchdog Timer" name="" value="0x1" />
         <value caption="Disable windowed Watchdog Timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="WDTCON__ON">
         <value caption="The WDT module is enabled" name="" value="0x1" />
         <value caption="The WDT module is disabled" name="" value="0x0" />
      </value-group>
   </module>
</modules>
<pinouts/>
</avr-tools-device-file>

